app/Services/CommonQuestion/ListCommonQuestionService.php

    public function list(): Collection
    {
        return CommonQuestion::query()
            ->select('id', 'answer','question', 'status_id', 'created_at')
            ->with('status:id,name')
            ->where('status_id', '=', StatusEnum::ACTIVE->value)
            ->get();
---
select "id", "answer", "question", "status_id", "created_at" from "common_questions" where "status_id" = 1 and "common_questions"."deleted_at" is null
select "id", "name" from "status" where "status"."id" in (1) and "status"."deleted_at" is null