app/Services/States/ListStatesService.php

select "id", "acronym", "description" from "states" where "states"."deleted_at" is null
---
    public static function list(): Collection
    {
        return Cache::remember('states', $seconds = 600, function () {
            return State::query()
                ->select('id', 'acronym', 'description')
                ->get();