app/Http/Requests/Auth/LoginRequest.php

select * from "users" where "username" = 'huriellopes' and "users"."deleted_at" is null limit 1
---
    public function authenticate(): void
    {
        try {
            $login = $this->clear_tags(request()->input('username'));

            $this->validateEmail($login);

            $user = User::query()
                ->when(filter_var($login, FILTER_VALIDATE_EMAIL), function ($query) use ($login) {
                    $query->where('email', '=', $login);
                    }, function ($query) use ($login) {
                    $query->where('username', '=', $login);
                })->first();