app/Services/Cities/ListCitiesService.php

    public function list(object $params = null): Collection
    {
        $listCities = City::query()->with('state');

        if (!empty($params)) {
            $this->getValidate()->validaParametros($params);
            $listCities->when(is_int($params->state_id), function ($query) use ($params) {
                return $query->where('state_id', $params->state_id);
            }, function ($query) use ($params) {
                return $query->whereHas('state', function ($query) use ($params) {
                    return $query->where('acronym', 'like', "%{$params->state}%");
                });
            });
        }

        return $listCities->get();
---
select * from "cities" where exists (select * from "states" where "cities"."state_id" = "states"."id" and "acronym"::text like '%%' and "states"."deleted_at" is null) and "cities"."deleted_at" is null
select * from "cities" where "state_id" = 7 and "cities"."deleted_at" is null
select * from "states" where "states"."id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27) and "states"."deleted_at" is null